[
    {
        "github":"https://github.com/dbdoyle182/Contech",
        "url":"https://contech-app.herokuapp.com/",
        "name":"Contech",
        "gif":"./images/contechgif.gif",
        "description":"The inspiration behind this project came from our experience when beginning UNCC’s Coding Bootcamp. If we searched for an unfamiliar term online, we could easily find ourselves inundated with vast amounts of information. We found that it wasn’t just developers that ran into this issue, but also those that worked with developers. Our app is a quick reference tool that provides simplified definitions to these complex terms. Our app is for developers, those that work with developers, or anyone that is new to the industry.",
        "technologies": ["React.js","JSWebTokens","Axios","Bcrypt","Express.js","Node.js","Moment","Mongoose","MongoDB","Passport","Validator","JSX", "ES6", "CSS", "CSS Grid","API","JSON"],
        "client":false
    },
    {
        "github":"https://github.com/dbdoyle182/Bootcamp-Overflow",
        "url":"https://bootcamp-overflow.herokuapp.com/",
        "name":"BootCamp_Overflow",
        "gif":"./images/bootcampoverflow.gif",
        "description":"Bootcamp_Overflow is application inspired by Stack_Overflow but built for the growing community of past/present/future students of Coding Bootcamps. The community on Stack Overflow tends to vary in terms of experience and how willing they are to cooperate. The attitude towards those new to computer science can be negative so we wanted to create a better environment for growing and learning. The page allows users to create a personal profile to interact with our forum to ask questions and leave comments. This tool aims to help the community of Trilogy learn together and stay in touch.",
        "technologies":[
            "Body-Parser",
            "Bulma.io",
            "Connect-Flash",
            "Express.js",
            "Node.js",
            "Express Handlebars",
            "Express Session",
            "Express Validator",
            "Handlebars",
            "MySQL",
            "Sequelize",
            "Passport",
            "JavaScript",
            "CSS",
            "API",
            "JSON"
        ],
        "client": false
    },
    {
        "github":"https://github.com/dbdoyle182/Moveasy",
        "url":"https://dbdoyle182.github.io/Moveasy/",
        "name":"Moveasy",
        "gif":"./images/moveasy.gif",
        "description":"Moveasy is an application designed to making moving easy. We compile data from multiple APIs into a user friendly interface to give a taste of what the city the user searches may be like. We provide a few of the top cities in the country. The project goal was to simply frame what we wanted the application to look like and how we wanted the application to function. This application is currently only for the United States.",
        "technologies":[
            "JavaScript",
            "Firebase",
            "Firebase Authentication",
            "Zomato API",
            "Google Maps API",
            "Open Weather API",
            "Foundation CSS",
            "jQuery",
            "Moment",
            "CSS"
        ],
        "client": false
    },
    {
        "github":"https://github.com/dbdoyle182/photobooth_app",
        "url":"https://whispering-temple-27601.herokuapp.com/",
        "name":"Photobooth Application",
        "gif":"./images/photobooth.gif",
        "description":"A simple photobooth application with vanilla javascript and simple server. The goal of this project was to work with simple JavaScript and to take advantage of the powerful tools provided to developers with just JavaScript. There are no libraries brought in to build this application. The back end server is built using Express servers and Node.js",
        "technologies":[
            "JavaScript",
            "JavaScript Canvas",
            "JavaScript Webcamera",
            "CSS",
            "Express.js",
            "Node.js"
        ],
        "client": false
    },
    {
        "github":"https://github.com/dbdoyle182/react-clicky-game",
        "url":"https://dbdoyle182.github.io/react-clicky-game/",
        "name":"NBA Memory",
        "gif":"./images/nba.gif",
        "description":"A single page application that mimics the memory card games that we played as kids. I truly enjoyed reading about React.js so I created this application using the create-react-app CLI. The goal was to take a theme of choice (NBA) and turn it into a fun game that players of all ages can enjoy. I will be using React Native to create a mobile application with this game.",
        "technologies":[
            "React.js",
            "CSS",
            "JSON",
            "JSX",
            "JavaScript"
        ],
        "client": false
    }
]